import UIKit
/*: # 에러 처리(Error Handling)
 */

/*: ## 에러 처리 문법
 - 에러(오류)의 이해
 ---
 */
/**=========================================================================
 
 - 에러의 종류는
 
   1) 컴파일 타임 에러 ===> 스위프트 문법과 관련된 에러(컴파일러가 미리 알고 수정해야한다고 알려줌)
 
   2) 런타임 에러 ===> 프로그램이 실행되는 동안 발생

 - 런타임 에러 ===> 크래시(앱이 강제로 종료)
 
   ===> 발생가능한 에러를 미리 처리해 두면, 강제종료되지 않음 (개발자가 처리해야만 하는 에러)
 
 ===========================================================================**/


/*: ---
 - (런타임)에러 처리가 왜 필요할까?
 ---
 */



/*: ---
 - 에러 처리의 과정 (3단계)
 ---
 */


/*: ---
 - 에러 발생가능한 함수의 형태
 ---
 */
