import UIKit

/*: # 문자열과 문자
 ---
 */

/*: ## 문자열과 문자(Strings and Characters)
 - 아스키코드와 유니코드
 ---
 */
/**================================================================================
 - 아스키코드(ASCII) / 유니코드(UNICODE)

  [아스키코드]
 - 참고: https://www.youtube.com/watch?v=apZFcOfAr5w

  [유니코드]
 - 참고: https://youtu.be/5aJKKgSEUnY
 - 참고: https://youtu.be/MijmeoH9LT4


 - 유니코드(Unicode)는 전 세계의 모든 문자를 컴퓨터에서 일관되게 표현하고 다룰 수 있도록 설계된 산업 표준
 - 스위프트는 유니코드의 체계를 사용
===================================================================================**/


